 # `úkol-08`: Adopce zvířat
Odkaz na lekci: https://kodim.cz/kurzy/python-data-1/python-pro-data-1/nacteni-dat/nacteni-dat

Odkaz na úkol: https://github.com/JankaMarschalkova/python-jaro-2023/blob/main/ukoly/ukol-08.md

Zpracovatel: Zuzana Musilová
Děkuji za kontrolu ;)

### Zadání:
Úkol můžeš odevzdat buďto jako Jupyter Notebook .ipynb, nebo jako klasický program .py.

Stáhni si dataset, který obsahuje seznam zvířat k adopci v ZOO Praha. Zdroj dat je Národní katalog otevřených dat.

Data si načti pomocí metody pandas.read_csv(). Pozor, nastav oddělovač na znak středníku. Využij parametr sep.

Seznam se s daty. Kolik má tabulka řádek a sloupců? Jak se sloupce jmenují?

Které zvíře se nachází na záznamu s indexem 34? Vypiš název tohoto zvířete v češtině a v angličtině.

#### Načítání dat

In [1]:
import pandas

In [4]:
seznam = pandas.read_csv('seznam_zvirat_k_adopci.csv',sep=';')
seznam

,id,nazev_cz,nazev_en,trida_cz,cena,k_prohlidce
0,7,Šváb syčivý,Madagascar giant cockroach,Bezobratlí,1000,1
1,8,Pakobylka okřídlená,Pink-winged stick insect,Bezobratlí,1000,1
2,16,Tayra,Tayra,Savci,5000,1
3,35,Kajmanka supí,Alligator snapping turtle,Plazi,2000,1
4,37,Želva žlutočelá,Indochinese box turtle,Plazi,1000,1
...,...,...,...,...,...,...
508,1417,Rosnice šalamounská,,Obojživelníci,1000,1
509,1418,Létavka obecná,,Obojživelníci,1000,1
510,1419,Bažant paví,,Ptáci,1000,1
511,1420,Sojkovec rezavouchý,,Ptáci,1000,1
512,1421,Kachnice kaštanová,,Ptáci,1000,1

#### Základní informace o tabulce

In [5]:
seznam.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 513 entries, 0 to 512
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           513 non-null    int64
 1   nazev_cz     513 non-null    object
 2   nazev_en     513 non-null    object
 3   trida_cz     513 non-null    object
 4   cena         513 non-null    int64
 5   k_prohlidce  513 non-null    int64
dtypes: int64(3), object(3)
memory usage: 24.2+ KB

In [6]:
#(pocet radek, pocet sloupcu)
seznam.shape

(513, 6)

In [7]:
seznam.columns

Index(['id', 'nazev_cz', 'nazev_en', 'trida_cz', 'cena', 'k_prohlidce'], dtype='object')

In [8]:
seznam.head()

,id,nazev_cz,nazev_en,trida_cz,cena,k_prohlidce
0,7,Šváb syčivý,Madagascar giant cockroach,Bezobratlí,1000,1
1,8,Pakobylka okřídlená,Pink-winged stick insect,Bezobratlí,1000,1
2,16,Tayra,Tayra,Savci,5000,1
3,35,Kajmanka supí,Alligator snapping turtle,Plazi,2000,1
4,37,Želva žlutočelá,Indochinese box turtle,Plazi,1000,1

In [9]:
seznam.tail()

       id             nazev_cz nazev_en       trida_cz  cena  k_prohlidce
508  1417  Rosnice šalamounská           Obojživelníci  1000            1
509  1418       Létavka obecná           Obojživelníci  1000            1
510  1419          Bažant paví                   Ptáci  1000            1
511  1420  Sojkovec rezavouchý                   Ptáci  1000            1
512  1421   Kachnice kaštanová                   Ptáci  1000            1

##### Zvíře na řádku s indexem 34 včetně en a cz názvu:

In [36]:
seznam.iloc[34]

id                     99
nazev_cz        Ibis bílý
nazev_en       White ibis
trida_cz            Ptáci
cena                 3000
k_prohlidce             1
Name: 34, dtype: object

## Nepovinný bonus
Využij metody sort_values() (a libovolných dalších metod), ke zjištění následujících informací:

Adopce kterých zvířat je nejdražší?
Které zvíře je alfabeticky poslední v češtině? Které v angličtině?
Bonus můžeš doplnit o nějaké vlastní pozorování.

##### Nejdražší zvířata k adopci:

Tento způsob nefunguje pro vypsání všech nejdražších zvířat.
Tak, alespoň níže jinak.

In [34]:
nejdrazsi = []
nejdrazsi = seznam.sort_values("cena")

In [35]:
nejdrazsi.iloc[512]

id                        381
nazev_cz         Slon indický
nazev_en       Asian elephant
trida_cz                Savci
cena                    50000
k_prohlidce                 1
Name: 128, dtype: object

Takto jsou vidět nejdražsí zvířata, ale musela jsem ručně nastavit hranici.

In [17]:
seznam[seznam['cena'] > 30000]

,id,nazev_cz,nazev_en,trida_cz,cena,k_prohlidce
113,334,Tygr ussurijský,Siberian tiger,Savci,50000,1
114,335,Tygr sumaterský,Sumatran tiger,Savci,50000,1
128,381,Slon indický,Asian elephant,Savci,50000,1
129,385,Hroch obojživelný,Hippopotamus,Savci,50000,1
135,396,Žirafa severní núbijská (= Rothschildova),Rothschild's giraffe,Savci,50000,1
272,897,Tygr malajský,Malayan tiger,Savci,50000,1

Tímhle bych si alespoň zjistila max u ceny.

In [13]:
seznam.describe()

                id          cena  k_prohlidce
count   513.000000    513.000000   513.000000
mean    793.033138   3309.941520     0.892788
std     449.135151   6339.394949     0.309685
min       7.000000   1000.000000     0.000000
25%     381.000000   1000.000000     1.000000
50%     820.000000   1500.000000     1.000000
75%    1216.000000   3000.000000     1.000000
max    1421.000000  50000.000000     1.000000

##### Alfabeticky poslední zvíře v CZ:

In [28]:
cz_seznam = []
cz_seznam = seznam.sort_values("nazev_cz")

In [31]:
cz_seznam.iloc[512]

id                               1190
nazev_cz                  Žluva hajní
nazev_en       Eurasian golden oriole
trida_cz                        Ptáci
cena                             1000
k_prohlidce                         1
Name: 371, dtype: object

##### Alfabeticky poslední zvíře v EN:

In [37]:
en_seznam = []
en_seznam = seznam.sort_values("nazev_en")

In [38]:
en_seznam.iloc[512]

id                                 491
nazev_cz           Frankolín žlutokrký
nazev_en       Yellow-necked francolin
trida_cz                         Ptáci
cena                              1000
k_prohlidce                          1
Name: 161, dtype: object